Static Public Member Functions | List of all members
ACAPI::MEP::ModifiableElement Class Referencefinal
MEP Element Manager
The Modifiable Element represents an instantiable ModifiableElementBase. More...
#include <MEPModifiableElement.hpp>
 Inheritance diagram for ACAPI::MEP::ModifiableElement:
 Static Public Member Functions
static Result< ModifiableElement >  | Get (const UniqueID &uniqueId)
Returns a Modifiable Element.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The Modifiable Element represents an instantiable ModifiableElementBase.
Since
Archicad 27
Member Function Documentation
◆ Get()
 static Result< ModifiableElement > ACAPI::MEP::ModifiableElement::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a Modifiable Element.
Parameters
uniqueId | The UniqueID of the requested Element.
Returns
If the uniqueId belongs to an Element, returns the object associated to it, otherwise Error.